{
	// Book Fair
	"Si.BC.BFName": "Book Fair",
	"Si.BC.BFStart": "The Book Fair has begun in Pelican Town!",
	"Si.BC.BFMailContent": "Dear @,^  I thought I'd let you know that Biblastic Books has offered to start sponsoring an annual Book Fair here in Pelican Town. The first Pelican Town Book Fair will be tomorrow from 8 AM to 5 PM, north of Pierre's. I hope to see you there! ^   -Penny",
	// Events
	"Si.BC.DadMailName": "Book From Dad",
	"Si.BC.DadMailContent": "Dear @,^  How's the farm life going? I found this in the garage, figured it might help you with that old farmhouse. Take care kiddo.^  Love, Dad.",
	"Si.BC.MomMailName": "Book From Mom",
	"Si.BC.MomMailContent": "Dear @,^  How are you sweety? I found this book for you. Please take care of yourself! And remember, we're proud of you! ^  Love, Mom",
	"Si.BC.ElliottMailName": "Elliott's Book",
	"Si.BC.ElliottMailContent": "Greetings @!^^I want to express my sincere appreciation for attending my public reading at the library yesterday. Your presence affirmed my confidence in my writing, and because of you I have made a name for myself in the published world. I've enclosed a copy of my book; I hope you find as much joy in reading it as I do in knowing you.^   -Warmest regards, Elliott",
	// Books
	"Si.BC.SaltBookName": "101 Gourmand Tomato Salt Recipes",
	"Si.BC.SaltBookDesc": "The pictures on the cover make the book itself look delicious!",
	"Si.BC.SaltBookContent": "^^Once you've spread the spoon of cottage cheese evenly over your slice of toasted sourdough, sprinkle a few pinches of tomato salt on top and enjoy.",
	"Si.BC.AdvMagBookName": "Adventurer Magazine",
	"Si.BC.AdvMagBookDesc": "This issue looks pretty old.",
	"Si.BC.AdvMagBookContent": "^^Interviewer: So, Gil, tell us about yourself.^Gil: Well I've been adventuring since my buddy Marlon and I used to sneak into the mines when we were kids.^Interviewer: I bet slimes gave you two a fright back then!^Gil: Ah yeah, we were fending 'em off with sticks and stones!",
	"Si.BC.AdvHealBookName": "Adventures In Healing: The Field Medic's Handbook",
	"Si.BC.AdvHealBookDesc": "It looks like this copy has been well-thumbed through.",
	"Si.BC.AdvHealBookContent": "Forward:^Some choose to brave the dangers of the world, fighting monsters, spirits, and the very essence of evil itself. Others prefer the safety and comfort of their clinics, where they can enjoy some nice coffee, read a good book, and wait for members of the first group to be rolled in on stretchers, wounded and regretting every decision they've ever made. If you are a member of the second group, this book is for you.",
	"Si.BC.AardvarkBookName": "The Amazing Aardvark-Man!",
	"Si.BC.AardvarkBookDesc": "The adventures of the astouunding superhero Aardvark-Man and his sidekick Otterboy.",
	"Si.BC.AardvarkBookContent": "Aardvark-Man whipped his head around to the source of the scream. 'Otterboy, take the Aardvark-Mobile! I'll meet you there!'^'On it!' Otterboy hopped into the Aardvark-Mobile and sped off.^Aardvark-Man shot out his elongated tongue and wrapped it around a lamp post. Once secure, he took off swinging through the night.",
	"Si.BC.ArchGuideName": "The Archaeologist's Field Guide",
	"Si.BC.ArchGuideDesc": "There's blades of grass and flecks of dirt between the pages.",
	"Si.BC.ArchGuideContent": "^^It's important to examine the context in which an artifact was discovered. Simply plucking an object off the ground and removing it from study disturbs valuable indicators such as location, other nearby artifacts, and the nature by which it was buried, causing that information to be lost to the ages.",
	"Si.BC.AstroBookName": "Astronomic Magazine",
	"Si.BC.AstroBookDesc": "There's a picture of a galaxy on the cover.",
	"Si.BC.AstroBookContent": "^^As the newly-formed galaxy spins, matter starts to gather at the center, building up and squeezing together until it eventually becomes a beautiful monstrosity known to many as a Black Hole.",
	"Si.BC.BatMatBookName": "The Bat on the Mat",
	"Si.BC.BatMatBookDesc": "A book written for children aged 3 and up.",
	"Si.BC.BatMatBookContent": "^^'I came here today, with a cape and top hat,^Can you please invite me inside?' Said the bat,^'Well you look really friendly, but you're scaring the cat',^the boy crossed his arms, 'so please stay on the mat.'",
	"Si.BC.BetterHomesBookName": "Better Homes and Gardens New Cook Book",
	"Si.BC.BetterHomesBookDesc": "Something about this book feels nostalgic.",
	"Si.BC.BetterHomesBookContent": "^^Excellent pies - even creamy, crumbly, or delicately flavored - may easily be the achievement of anyone who follows a few pivotal rules.",
	"Si.BC.ElliotTowerBookName": "Blue Tower",
	"Si.BC.ElliotTowerBookDesc": "This was written by Elliott!",
	"Si.BC.ElliotTowerBookContent": "^Chapter One^^From the shadows emerged a man, radiating with enigmatic omniscience. 'Good Evening, Mr. Lu,' he said, the corners of his mouth quivering. Lu seemed astonished.^'How did you know my name?'",
	"Si.BC.YobaBookName": "Book of Yoba",
	"Si.BC.YobaBookDesc": "The symbol of the front shimmers brightly.",
	"Si.BC.YobaBookContent": "^^And Yoba said 'may there be stardrops' and so there were stardrops.",
	"Si.BC.BookkeepingBookName": "Bookkeeping for Local Stores",
	"Si.BC.BookkeepingBookDesc": "Helping you keep your business in the black!",
	"Si.BC.BookkeepingBookContent": "^^In the modern day it is important for small business owners to use the tools they have at their disposal to keep up with their financials. Software that facilitates financial planning has become widely available for this purpose.",
	"Si.BC.CSharpBookName": "The C# Yellow Book",
	"Si.BC.CSharpBookDesc": "Why are your fingers suddenly covered with cheeto dust?",
	"Si.BC.CSharpBookContent": "^^The bad news about learning to program is that you get hit with a lot of ideas and concepts at around the same time when you start, and this can be confusing.",
	"Si.BC.ElliotStationBookName": "Camellia Station",
	"Si.BC.ElliotStationBookDesc": "This was written by Elliott!",
	"Si.BC.ElliotStationBookContent": "^Chapter One^^'Your ticket, sir?' Ticket collector Gozman extended a gloved hand towards the young commuter.^'Ah, yes. I have it right here,' he replied, reaching into his coat pocket. Mortified, he discovered that the ticket was missing.",
	"Si.BC.CampfireBookName": "Campfire Cooking: A Field Guide to Preparing Freshly Foraged Foods",
	"Si.BC.CampfireBookDesc": "A guide to safe and healthy eating from your surroundings.",
	"Si.BC.CampfireBookContent": "^^Seeds fallen from common trees can be used to make a simple snack that, while not particularly pleasant to ingest, proves nutritious and provides energy while foraging for more delectable options.",
	"Si.BC.ChickenBookName": "Chicken Rearing for Dummies",
	"Si.BC.ChickenBookDesc": "Huh, there's nothing about blue chickens in here.",
	"Si.BC.ChickenBookContent": "^^When building nesting boxes for your chickens, ensure the bottom is cushioned to catch the falling eggs without breaking them. Use natural materials such as hay and chopped straw.",
	"Si.BC.CrystalBookName": "Crystallic Symbolism",
	"Si.BC.CrystalBookDesc": "The meanings of various gems and minerals.",
	"Si.BC.CrystalBookContent": "^^Aquamarines symbolize tranquility and courage. Their soothing properties can relieve stress and fear, leaving behind a sense of peace.",
	"Si.BC.DMGBookName": "Dungeon Master's Guide",
	"Si.BC.DMGBookDesc": "A guide for hosting a tabletop game.",
	"Si.BC.DMGBookContent": "^^Challenge Rating, or CR, helps you plan encounters by putting a measure on how dangerous an enemy is. As a very general rule of thumb, an average party of four level 5 adventurers should be able to handle one CR 5 enemy with some difficulty but no serious damage to the party.",
	"Si.BC.ToolboxBookName": "The Engineer's Toolbox",
	"Si.BC.ToolboxBookDesc": "Material properties, steam tables, and more!",
	"Si.BC.ToolboxBookContent": "^Material Densities:^Copper:8.96 g/cm3^Iron: 7.87 g/cm3^Gold: 19.32 g/cm3^Iridium: 22.56 g/cm3",
	"Si.BC.FernBookName": "Fern Island Travel Brochure",
	"Si.BC.FernBookDesc": "A trip does sound nice.",
	"Si.BC.FernBookContent": "^^Scuba diving, dolphin watching, and incredible photographic opportunities of the Ginger Island Volcano await! Book your relaxing cruise along the Fern Islands today!",
	"Si.BC.WoodBookName": "The Fine Art Of Wood Joinery",
	"Si.BC.WoodBookDesc": "There's some really cool examples of carpentry in here.",
	"Si.BC.WoodBookContent": "^^A mortise and tenon joint is a simple yet strong joint that consists of adding a projection to one piece of wood, and inserting that projecting into a groove cut out of another piece of wood so that the two pieces fit neatly together.",
	"Si.BC.CloakBookName": "Fine Capes and Cloaks",
	"Si.BC.CloakBookDesc": "There's a rather dashing cloak on the cover.",
	"Si.BC.CloakBookContent": "^^A well-weighted cape will gently swish as you walk, and will only flare out dramatically when you intend it to do so by shifting your shoulders as you turn.",
	"Si.BC.FireproofingBookName": "Fireproofing Your Workshop",
	"Si.BC.FireproofingBookDesc": "There's a warning on the back that the book itself isn't fireproof.",
	"Si.BC.FireproofingBookContent": "^^Regularly clean your workshop, removing flammable materials such as wood shavings or dust, to minimize the impact of rogue embers.",
	"Si.BC.GridballBookName": "Gridball Rulebook",
	"Si.BC.GridballBookDesc": "Huh, you've always wondered how that game was played.",
	"Si.BC.GridballBookContent": "^^If a member of the opposing team is holding the ball but choosing to remain stationary inside the midfield, your team is allowed to call 'Rubber Duck', rush to your team's side of the field, and begin performing the Macarena as outlined in section 8 paragraph 3C.",
	"Si.BC.GoldBookName": "Guide to Goldsmithing",
	"Si.BC.GoldBookDesc": "For hobby and profit.",
	"Si.BC.GoldBookContent": "^^Abrasive materials can tarnish a gold's natural luster due to its softness. Instead, use a soft cloth or toothbrush, and dip in a muxture of warm water and mild dish soap for best results.",
	"Si.BC.CleanSpellsBookName": "Housekeeping Charms & Spells",
	"Si.BC.CleanSpellsBookDesc": "The illustrations on the cover appear to be animated.",
	"Si.BC.CleanSpellsBookContent": "^^Socks charmed to fold themselves may become confused and wind up paired with other socks than the ones they came with. To rectify this, ensure every pair of socks you own has a bright, unique pattern.",
	"Si.BC.GuineaBookName": "How to Train your Guinea Pig",
	"Si.BC.GuineaBookDesc": "The one on the cover is so cute!",
	"Si.BC.GuineaBookContent": "^^Slowly move the treat in a circle, allowing the guinea pig to follow the treat around. Once you've completed a few circles, say 'Circle!' with a positive tone and give the treat to the guinea pig.",
	"Si.BC.Human101BookName": "Human 101",
	"Si.BC.Human101BookDesc": "You never realized how complicated humans can appear to be.",
	"Si.BC.Human101BookContent": "^^When a human bares their teeth, they are not trying to intimidate. Instead, the baring of teeth indicates friendliness and approachability, especially when accompanied by the upturning of their mouth corners, and an extended appendage. The appendage is related to an act known as a 'handshake', which will be covered in the next chapter.",
	"Si.BC.HumanLingoBookName": "Human Language",
	"Si.BC.HumanLingoBookDesc": "It sure is detailed.",
	"Si.BC.HumanLingoBookContent": "^^Similar examples of modern slang can be seen in the following phrases:^LOL: Laughing Out Loud^BRB: Be Right Back^IDK: I Don't Know",
	"Si.BC.FlowerLingoBookName": "The Language of Flowers",
	"Si.BC.FlowerLingoBookDesc": "There's a few flowers pressed between the pages.",
	"Si.BC.FlowerLingoBookContent": "^^The crocus symbolizes cheerfulness, youthfulness, and the awakening of spring from winter.",
	"Si.BC.BusBookName": "Lessons in Bus Driving",
	"Si.BC.BusBookDesc": "It looks like this book was accompanied by a video series, but the CD is missing.",
	"Si.BC.BusBookContent": "^^Always make sure to check your rear-view mirrors. Even after you've done that, keep your eyes and ears peeled for horns, shouting, and other indications of something behind you. A bus has many blind spots you may be unaware of.",
	"Si.BC.HomeownerBookName": "Maintenance for First-Time Homeowners",
	"Si.BC.HomeownerBookDesc": "Tips and tricks for keeping your house in one piece!",
	"Si.BC.HomeownerBookContent": "^^Personal protective equipment for fireplace maintenance should include the following: a dust mask, safety goggles, work gloves, and long-sleeved shirt, pants, and footwear.",
	"Si.BC.MarketArtBookName": "Marketing Art",
	"Si.BC.MarketArtBookDesc": "Recommended by Lupini himself.",
	"Si.BC.MarketArtBookContent": "^^Always keep your audience at the focus of your marketing. Give them space to interpret the meaning of your artwork. By encouraging them to develop that interpretation, they become more likely to purchase the work for further reflection.",
	"Si.BC.MarnieLogBookName": "Marnie's Logbook",
	"Si.BC.MarnieLogBookDesc": "There's details about every animal on the farm in here!",
	"Si.BC.MarnieLogBookContent": "^^Summer Stats:^Cows 9 | Goats 3 | Sheep 2^Chickens 14 | Ducks 7 | Rabbits 4",
	"Si.BC.PennyBookName": "The Mystery of Firebrook Manor",
	"Si.BC.PennyBookDesc": "Young reporter Eliana stumbles across an unsolved case from a century ago and sets out to make a name for herself. Little does she know what lies in store...",
	"Si.BC.PennyBookContent": "^^Eliana jumped at the sudden sound of creaking plaster and turning gears. Looking back, she saw the grates of the fireplace now open, and a newly-formed set of steps behind them. Letting go of the vase, which clicked back into place, she hesitantly peered down the stairs into the darkness.",
	"Si.BC.NatGeoBookName": "National Geography",
	"Si.BC.NatGeoBookDesc": "There's a lizard covered in leaves on the cover.",
	"Si.BC.NatGeoBookContent": "^^The Sungazer is a heavily armored species of lizard native to grassland biomes. Digging burrows and living off insects, these lizards can live for over twenty years.",
	"Si.BC.NavBookName": "Ocean Navigation Quick Reference",
	"Si.BC.NavBookDesc": "The pages are rather damp.",
	"Si.BC.NavBookContent": "^^When facing towards the front of the boat (known as the 'bow'), on your left is the 'port' side and on your right is the 'starboard' side. Behind you is the 'stern'. 'Windward' is the direction the wind is coming from, while 'leeward' is the direction the wind is headed to.",
	"Si.BC.PHBBookName": "Player's Handbook",
	"Si.BC.PHBBookDesc": "A handbook for players of a tabletop game.",
	"Si.BC.PHBBookContent": "Your Ability Score determines how good your character is at each of the core abilities: Strength, Dexterity, Constitution, Charisma, Intelligence, and Wisdom. Having a higher score in an ability will give you higher bonuses to skills associated with that ability. For example, a high Charisma will boost your Persuasion skill.",
	"Si.BC.PrincessBookName": "The Princess and the Sword",
	"Si.BC.PrincessBookDesc": "A book written for children aged 4 and up.",
	"Si.BC.PrincessBookContent": "^^Amy took the sword. 'Thank you, Miss Dragon. I will take good care of it.'^Miss Dragon smiled at Amy. 'You are welcome Princes Amy. Now you are ready to fight the evil Prince and save the kingdom.",
	"Si.BC.ReadersDigestBookName": "Reader's Digest",
	"Si.BC.ReadersDigestBookDesc": "In this issue: Heroic Pets, Using Laughter as Medicine, and 5 Gotoran recipies for you to try at home!",
	"Si.BC.ReadersDigestBookContent": "^^The Zuzu City Fire Department were very confused to see a cat run up and start tugging at their boots one evening.^'We thought it wanted one of our noodle cups.' The Zuzu City Fire Chief remarked.^But it turns out Nightlight the Cat was actually trying to save her human's home, which had lit on fire due to a sparking electrical outlet.",
	"Si.BC.ElliotPlanetBookName": "The Rise and Fall of Planet Yazzo",
	"Si.BC.ElliotPlanetBookDesc": "This was written by Elliott!",
	"Si.BC.ElliotPlanetBookContent": "^Chapter One^^Commander Yutkin stepped through the golden archway as the airlock snapped shut behind him. Today was his first day on Planet Yazzo, and all 14 of the alliance delegates had been summoned to the Grand Spire.",
	"Si.BC.StyleBookName": "Style Magazine",
	"Si.BC.StyleBookDesc": "Looks like a fashion magazine",
	"Si.BC.StyleBookContent": "^^This season is all about scarves! A well-draped scarf will boost your confidence in any context. Try a half bow knot on a silk scarf for a classy look, or drape it over your shoulders for a fun night out!",
	"Si.BC.CareBookName": "Taking Care of Yourself",
	"Si.BC.CareBookDesc": "Tips for physical, mental, and emotional self-care. Remember, health is wealth!",
	"Si.BC.CareBookContent": "^^Taking a moment for yourself is an important way to keeping your mind clear. Let's start small right now: clear your mind of any thoughts. Then slowly inhale through your nose until you feel content with how much air is in your lungs. Count to three, and then slowly let the air out throught your mouth.",
	"Si.BC.ChimneyBookName": "A Tale of Two Chimneys",
	"Si.BC.ChimneyBookDesc": "Ella's first interaction with her new neighbor blossoms into something she never thought she'd find. But is it enough to overcome what's ahead?",
	"Si.BC.ChimneyBookContent": "^^She pressed her forehead into Ella's and tangled their fingers together. 'Don't worry! We'll pull through.'^Ella smiled back, but it wasn't enough to mask the concern in her eyes.^'Just be careful, love.'",
	"Si.BC.SoldierBookName": "Welcome Home: A Soldier's Guide to Returning to Civilian Life",
	"Si.BC.SoldierBookDesc": "Strategies for adjusting to being back home.",
	"Si.BC.SoldierBookContent": "^^Your family members may have difficulty understanding what you've gone through, but it's important to remember that they love you and want to help you however they can. When there's something you need, like a boundary or some space, be clear and upfront with them about that.",
	// Si's other mods
	"Si.BC.AAMinesBookName": "Surviving the Mines",
	"Si.BC.AAMinesBookDesc": "This looks like one of the books Marlon lent Abigail for her adventurer studies.",
	"Si.BC.AAMinesBookContent": "^^The most common creature you'll encounter in the mines are slimes. Oozing with a pungent, sticky substance, these beings can congregate together to form larger entities known for absorbing entire adventurers whole.",
	"Si.BC.AASwordBookName": "Sword Care and Maintenance",
	"Si.BC.AASwordBookDesc": "This looks like one of the books Marlon lent Abigail for her adventurer studies.",
	"Si.BC.AASwordBookContent": "^^To clean the blade, apply a few drops of your selected oil solution to a cloth and gently swipe it along the metal so that you are left with a thin sheen of oil. The sword should not be dripping or excessively damp.",
	"Si.BC.LCLeafBookName": "Trees of the Ferngill Republic",
	"Si.BC.LCLeafBookDesc": "This book is full of information about different kinds of trees and their leaves.",
	"Si.BC.LCLeafBookContent": "^^Maples and Oaks can be found in equal measure atop the mountains that dot the coast of the Ferngill Republic. While they take on stunning hues in the fall season, both are outnumbered by the evergreen pines that weather the cold winters.",
	"Si.BC.MRCleaningBookName": "How to Clean Old Buildings",
	"Si.BC.MRCleaningBookDesc": "The cover is immaculate.",
	"Si.BC.MRCleaningBookContent": "^^To preserve old construction, avoid the use of harsh chemicals and opt for gentler solutions, including brushes and dry cloths to remove dust.",
	"Si.BC.SFSGuideBookName": "Gourmand Frog Conservation Guide",
	"Si.BC.SFSGuideBookDesc": "A handbook for frog conservation projects.",
	"Si.BC.SFSGuideBookContent": "^^Healthy adult frogs should have a mix of live insects in their diet, including crickets, earthworms, caterpillars, and dragonflies.",
	"Si.BC.SFSSoilBookName": "Optimal Soil Conditions for the Anura Gourmand Frog Subspecies",
	"Si.BC.SFSSoilBookDesc": "A research paper on gourmand frogs.",
	"Si.BC.SFSSoilBookContent": "^^A pH range that is neutral to slightly acidic will promote healthy growth and a welcoming reproductive atmosphere for anura gourmand frogs during the mating season.",
}